Tekla Open API Reference for Tekla Structures 2025
PropertyElement Class
 The PropertyElement class may represent any of the many different mark element types, such as the profile, the material and the name. The property is defined by the name and it is converted into a textual value before the mark is drawn.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.ElementBase
 Tekla.Structures.Drawing.PropertyElement
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PropertyElement : ElementBase
<SerializableAttribute>
Public Class PropertyElement
	Inherits ElementBase
The PropertyElement type exposes the following members.
Constructors
Name | Description
PropertyElement
 Creates a new property element instance with the given property element type.
Top
Properties
Name | Description
Font
 The font of the property.
Name
 The property name.
PropertyType
 The type of the property element.
Value
 The current value of the property.
Top
Methods
Name | Description
Clone
 Clones the object.
 (Overrides ElementBase.Clone().)
GetUnformattedString
 Returns the content as a string without formatting.
 (Overrides ElementBase.GetUnformattedString().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ElementBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace